test/performance/logs/k6-test-2025-02-06-211302.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/performance/scenario_1_single_tokenCreate_test.js
        output: InfluxDBv1 (http://localhost:8086)

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


     ✓ Token Reset Successful
     ✓ Token Created

     checks.........................: 100.00% 2 out of 2
     data_received..................: 362 B   4.5 kB/s
     data_sent......................: 206 B   2.6 kB/s
     http_req_blocked...............: avg=254µs   min=5µs     med=254µs   max=503µs   p(90)=453.2µs p(95)=478.1µs 
     http_req_connecting............: avg=59µs    min=0s      med=59µs    max=118µs   p(90)=106.2µs p(95)=112.1µs 
     http_req_duration..............: avg=38.65ms min=22.32ms med=38.65ms max=54.98ms p(90)=51.71ms p(95)=53.35ms 
       { expected_response:true }...: avg=38.65ms min=22.32ms med=38.65ms max=54.98ms p(90)=51.71ms p(95)=53.35ms 
     http_req_failed................: 0.00%   0 out of 2
     http_req_receiving.............: avg=128.5µs min=47µs    med=128.5µs max=210µs   p(90)=193.7µs p(95)=201.84µs
     http_req_sending...............: avg=16µs    min=11µs    med=16µs    max=21µs    p(90)=20µs    p(95)=20.5µs  
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=38.5ms  min=22.1ms  med=38.5ms  max=54.91ms p(90)=51.63ms p(95)=53.27ms 
     http_reqs......................: 2       24.990941/s
     iteration_duration.............: avg=79.55ms min=79.55ms med=79.55ms max=79.55ms p(90)=79.55ms p(95)=79.55ms 
     iterations.....................: 1       12.49547/s


running (00m00.1s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m00.1s/10m0s  1/1 shared iters